Цель тестирования: Проверить функциональность сортировки товаров по цене на сайте.

Предпосылки: Открыть сайт 777flowers.ru.

Шаги тестирования:

1. Перейти на страницу каталога товаров.  
   Ожидаемый результат: Отображение страницы каталога товаров.
   
2. Выбрать диапазон значений для сортировки.  
   Ожидаемый результат: Поля для ввода доступны и могут быть заполнены.
   
3. Нажать кнопку "Показать".  
   Ожидаемый результат: Отображение товаров после нажатия кнопки.
   
4. Проверить отображение товаров на странице в соответствии с указанным диапазоном цен.  
   Ожидаемый результат: Товары соответствуют заданному диапазону цен.

—

Сценарий тестирования:

Цель тестирования: Проверить наличие формы обратной связи на странице контактов.

Предпосылки: Открыть сайт 777flowers.ru.

Шаги тестирования:

1. Перейти на страницу контактов.  
   Ожидаемый результат: Отображение страницы контактов.
   
2. Проверить наличие формы и кликабельность полей.  
   Ожидаемый результат: Форма обратной связи доступна для заполнения.
   
3. Заполнить необходимые данные и нажать кнопку "Отправить".  

_

Ожидаемый результат:
   Появление окна с подтверждением отправки сообщения
